#### Bibliotecas

In [1]:
import pandas as pd

#### Carregamento dos Dados

In [2]:
acessos = pd.read_excel('compras_e_acessos.xlsx', sheet_name='acessos')

In [3]:
acessos

   user_id user_name  total
0        8     RENAN     10
1        3  GABRIELA      2
2        5    REBECA    399
3        6     PEDRO     21
4        7     JAMES      1

In [4]:
compras = pd.read_excel('compras_e_acessos.xlsx', sheet_name='compras')

In [5]:
compras

   user_id user_name  total
0        2      JOÃO     78
1        3  GABRIELA    100
2        5    REBECA     22
3        6     PEDRO    332
4        1   MARIANA     13

#### Merge com intersecção

SQL JOIN: Usuários que tem acessos E compras, trazendo também as informações de ambas tabelas. O inner join traz todos os valores que são comuns em ambas as tabelas.

In [6]:
inner_join = acessos.merge(compras, how='inner', on='user_id')

In [7]:
inner_join

   user_id user_name_x  total_x user_name_y  total_y
0        3    GABRIELA        2    GABRIELA      100
1        5      REBECA      399      REBECA       22
2        6       PEDRO       21       PEDRO      332

In [9]:
inner_join.rename(columns={'total_x':'total_acessos', 'total_y':'total_compras'}, inplace=True)

In [10]:
inner_join

   user_id user_name_x  total_acessos user_name_y  total_compras
0        3    GABRIELA              2    GABRIELA            100
1        5      REBECA            399      REBECA             22
2        6       PEDRO             21       PEDRO            332

SQL LEFT JOIN: Usuáio que tem acessos mas também queremos trazer o total de compras caso tenham feito. O left join traz todos os valores da tabela a esquerda e os valores da direita em comum, caso o valor exista na primeira tabela e não na segunda ele retorna `NaN`.

In [11]:
left_join = acessos.merge(compras, how='left', on='user_id')

In [12]:
left_join

   user_id user_name_x  total_x user_name_y  total_y
0        8       RENAN       10         NaN      NaN
1        3    GABRIELA        2    GABRIELA    100.0
2        5      REBECA      399      REBECA     22.0
3        6       PEDRO       21       PEDRO    332.0
4        7       JAMES        1         NaN      NaN

SQL RIGHT JOIN: Usuários que tem compras mas também queremos trazer o total de acessos caso tenham. O right join traz todos os valores da tabela a direita e os valores em comum na tabela da esquerda, caso o valor exista na segunda tabela e não exista na primeira ele retorna o valor `NaN`.

In [13]:
right_join = acessos.merge(compras, how='right', on='user_id')

In [14]:
right_join

   user_id user_name_x  total_x user_name_y  total_y
0        2         NaN      NaN        JOÃO       78
1        3    GABRIELA      2.0    GABRIELA      100
2        5      REBECA    399.0      REBECA       22
3        6       PEDRO     21.0       PEDRO      332
4        1         NaN      NaN     MARIANA       13

SQL FULL JOIN: Usuários que tem acessos OU compras, trazendo as informações de ambos caso existam. O full join traz todos os valores de ambas as tabelas e onde existirem valores faltantes ele exibe o valor `NaN`.

In [15]:
full_join = acessos.merge(compras, how='outer', on='user_id')

In [16]:
full_join

   user_id user_name_x  total_x user_name_y  total_y
0        8       RENAN     10.0         NaN      NaN
1        3    GABRIELA      2.0    GABRIELA    100.0
2        5      REBECA    399.0      REBECA     22.0
3        6       PEDRO     21.0       PEDRO    332.0
4        7       JAMES      1.0         NaN      NaN
5        2         NaN      NaN        JOÃO     78.0
6        1         NaN      NaN     MARIANA     13.0

#### Merge sem intersecção

In [17]:
acessos

   user_id user_name  total
0        8     RENAN     10
1        3  GABRIELA      2
2        5    REBECA    399
3        6     PEDRO     21
4        7     JAMES      1

In [18]:
compras

   user_id user_name  total
0        2      JOÃO     78
1        3  GABRIELA    100
2        5    REBECA     22
3        6     PEDRO    332
4        1   MARIANA     13

SQL LEFT JOIN: usuários que tem acessos mas que não tenham compras

In [19]:
# usamos indicator = True para identificar quais registros aparecem apenas na tabela da esquerda.
left_join2 = acessos.merge(compras, how='left', on='user_id', indicator=True)

In [20]:
left_join2

   user_id user_name_x  total_x user_name_y  total_y     _merge
0        8       RENAN       10         NaN      NaN  left_only
1        3    GABRIELA        2    GABRIELA    100.0       both
2        5      REBECA      399      REBECA     22.0       both
3        6       PEDRO       21       PEDRO    332.0       both
4        7       JAMES        1         NaN      NaN  left_only

In [21]:
# filtrando os valores que aparecem apenas na tabela da esquerda (left_only)
left_join2 = left_join2[left_join2._merge == 'left_only']

In [22]:
left_join2

   user_id user_name_x  total_x user_name_y  total_y     _merge
0        8       RENAN       10         NaN      NaN  left_only
4        7       JAMES        1         NaN      NaN  left_only

SQL RIGHT JOIN: usuários que tem compras mas não tem acessos.

In [23]:
right_join2 = acessos.merge(compras, how='right', on='user_id', indicator=True)

In [24]:
right_join2

   user_id user_name_x  total_x user_name_y  total_y      _merge
0        2         NaN      NaN        JOÃO       78  right_only
1        3    GABRIELA      2.0    GABRIELA      100        both
2        5      REBECA    399.0      REBECA       22        both
3        6       PEDRO     21.0       PEDRO      332        both
4        1         NaN      NaN     MARIANA       13  right_only

In [25]:
# filtrando valores que aparecem apenas na tabela da direita (right_only)
right_join2 = right_join2[right_join2._merge == 'right_only']

In [26]:
right_join2

   user_id user_name_x  total_x user_name_y  total_y      _merge
0        2         NaN      NaN        JOÃO       78  right_only
4        1         NaN      NaN     MARIANA       13  right_only

SQL FULL JOIN: usuários que tem acessos OU compras mas que tenham os dois ao mesmo tempo.

In [27]:
full_join2 = acessos.merge(compras, how='outer', on='user_id', indicator=True)

In [28]:
full_join2

   user_id user_name_x  total_x user_name_y  total_y      _merge
0        8       RENAN     10.0         NaN      NaN   left_only
1        3    GABRIELA      2.0    GABRIELA    100.0        both
2        5      REBECA    399.0      REBECA     22.0        both
3        6       PEDRO     21.0       PEDRO    332.0        both
4        7       JAMES      1.0         NaN      NaN   left_only
5        2         NaN      NaN        JOÃO     78.0  right_only
6        1         NaN      NaN     MARIANA     13.0  right_only

In [29]:
# filtrando valores que aparecem apenas na tabela esquerda OU direita
full_join2 = full_join2[full_join2._merge != 'both']

In [30]:
full_join2

   user_id user_name_x  total_x user_name_y  total_y      _merge
0        8       RENAN     10.0         NaN      NaN   left_only
4        7       JAMES      1.0         NaN      NaN   left_only
5        2         NaN      NaN        JOÃO     78.0  right_only
6        1         NaN      NaN     MARIANA     13.0  right_only